MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX575F512L.atdf
         <register caption="I2C Status Register" name="I2C2STAT" offset="0x410" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C2STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C2STAT__RBF" />
            <bitfield caption="Read/Write Information bit (when operating as I2C slave)" mask="0x00000004" name="R_W" values="I2C2STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C2STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C2STAT__P" />
            <bitfield caption="Data/Address bit (when operating as I2C slave)" mask="0x00000020" name="D_A" values="I2C2STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C2STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C2STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C2STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C2STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C2STAT__BCL" />
            <bitfield caption="Transmit Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00004000" name="TRSTAT" values="I2C2STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00008000" name="ACKSTAT" values="I2C2STAT__ACKSTAT" />
         </register>
         <register caption="" name="I2C3ADD" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C4ADD" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C5ADD" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C1ADD" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C2ADD" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C3MSK" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C4MSK" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C5MSK" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C1MSK" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C2MSK" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C3BRG" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C4BRG" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C5BRG" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C1BRG" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C2BRG" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C3TRN" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C4TRN" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C5TRN" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C1TRN" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C2TRN" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C3RCV" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
         <register caption="" name="I2C4RCV" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
         <register caption="" name="I2C5RCV" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
         <register caption="" name="I2C1RCV" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
         <register caption="" name="I2C2RCV" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
      </register-group>
      <value-group caption="Start Condition Enable bit (when operating as I2C master)" name="I2C3CON__SEN">
         <value caption="Initiate Start condition on SDAx and SCLx pins. Hardware clear at end of master Start sequence." name="" value="0x1" />
         <value caption="Start condition not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Repeated Start Condition Enable bit (when operating as I2C master)" name="I2C3CON__RSEN">
         <value caption="Initiate Repeated Start condition on SDAx and SCLx pins. Hardware clear at end of master Repeated Start sequence." name="" value="0x1" />
         <value caption="Repeated Start condition not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop Condition Enable bit (when operating as I2C master)" name="I2C3CON__PEN">
         <value caption="Initiate Stop condition on SDAx and SCLx pins. Hardware clear at end of master Stop sequence." name="" value="0x1" />
         <value caption="Stop condition not in progress" name="" value="0x0" />
      </value-group>
