MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX575F512L.atdf
      <value-group caption="Parity and Data Selection bits" name="U5MODE__PDSEL">
         <value caption="9-bit data no parity" name="" value="0x3" />
         <value caption="8-bit data odd parity" name="" value="0x2" />
         <value caption="8-bit data even parity" name="" value="0x1" />
         <value caption="8-bit data no parity" name="" value="0x0" />
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U5MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1" />
         <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U5MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1" />
         <value caption="UxRX Idle state is 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U5MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Baud rate measurement is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U5MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1" />
         <value caption="Loopback mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U5MODE__WAKE">
         <value caption="Wake-up is enabled" name="" value="0x1" />
         <value caption="Wake-up is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bits" name="U5MODE__UEN">
         <value caption="UxTX, UxRX and UxBCLK pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x3" />
         <value caption="UxTX, UxRX, UxCTS and UxRTS pins are enabled and used" name="" value="0x2" />
         <value caption="UxTX, UxRX and UxRTS pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x1" />
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U5MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1" />
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0" />
      </value-group>
      <value-group caption="IrDA Encoder and Decoder Enable bit" name="U5MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1" />
         <value caption="IrDA is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U5MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bit" name="U5MODE__ON">
         <value caption="UARTx is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1" />
         <value caption="UARTx is disabled. All UARTx pins are controlled by corresponding bits in the PORTx, TRISx and LATx registers; UARTx power consumption is minimal" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Data Available bit (read-only)" name="U1STA__URXDA">
         <value caption="Receive buffer has data, at least one more character can be read" name="" value="0x1" />
         <value caption="Receive buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Overrun Error Status bit." name="U1STA__OERR">
         <value caption="Receive buffer has overflowed" name="" value="0x1" />
         <value caption="Receive buffer has not overflowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Framing Error Status bit" name="U1STA__FERR">
         <value caption="Framing error has been detected for the current character" name="" value="0x1" />
         <value caption="Framing error has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Parity Error Status bit" name="U1STA__PERR">
         <value caption="Parity error has been detected for the current character" name="" value="0x1" />
         <value caption="Parity error has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Idle bit" name="U1STA__RIDLE">
         <value caption="Receiver is Idle" name="" value="0x1" />
         <value caption="Data is being received" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Character Detect bit" name="U1STA__ADDEN">
         <value caption="Address Detect mode is enabled. If 9-bit mode is not selected" name="" value="0x1" />
         <value caption="Address Detect mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Interrupt Mode Selection bit" name="U1STA__URXISEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt flag bit is asserted while receive buffer is 3/4 or more full (i.e., has 6 or more data characters)" name="" value="0x2" />
         <value caption="Interrupt flag bit is asserted while receive buffer is 1/2 or more full (i.e., has 4 or more data characters)" name="" value="0x1" />
         <value caption="Interrupt flag bit is asserted while receive buffer is not empty (i.e., has at least 1 data character)" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Shift Register is Empty bit (read-only)" name="U1STA__TRMT">
         <value caption="Transmit shift register is empty and transmit buffer is empty (the last transmission has completed)" name="" value="0x1" />
         <value caption="Transmit shift register is not empty, a transmission is in progress or queued in the transmit buffer" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit (read-only)" name="U1STA__UTXBF">
         <value caption="Transmit buffer is full" name="" value="0x1" />
         <value caption="Transmit buffer is not full, at least one more character can be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Enable bit" name="U1STA__UTXEN">
         <value caption="UARTx transmitter is enabled. UxTX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx transmitter is disabled. Any pending transmission is aborted and buffer is reset. UxTX pin is controlled by the port." name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Break bit" name="U1STA__UTXBRK">
         <value caption="Send Break on next transmission. Start bit followed by twelve 0 bits, followed by Stop bit; cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Break transmission is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Enable bit" name="U1STA__URXEN">
         <value caption="UARTx receiver is enabled. UxRX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx receiver is disabled. UxRX pin is ignored by the UARTx module. UxRX pin is controlled by the port." name="" value="0x0" />
      </value-group>
